## Primeiro bloco de código

In [1]:
import pandas as pd

df_data = {'pais': ['Brasil', 'Argentina','Argentina', 'Brasil', 'Chile','Chile'],
           'ano': [2005, 2006, 2005, 2006, 2007, 2008],
           'populacao': [170.1, 30.5, 32.2, 172.6, 40.8, 42.0]}
df = pd.DataFrame(df_data)
print(df)

        pais   ano  populacao
0     Brasil  2005      170.1
1  Argentina  2006       30.5
2  Argentina  2005       32.2
3     Brasil  2006      172.6
4      Chile  2007       40.8
5      Chile  2008       42.0

### TITANIC exemplo

In [2]:
import pandas as pd

train_dataset = pd.read_csv('train.csv')

print(train_dataset.head())

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S

In [3]:
# Pegando apenas uma coluna pelo nome
print(train_dataset['Age'])

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [4]:
# Outra maneira de pegar os dados de uma coluna
print(train_dataset.Sex)

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: Sex, Length: 891, dtype: object

In [5]:
# Ou um vetor de dados da coluna
print(train_dataset[['Sex','Age','Fare']])

        Sex   Age     Fare
0      male  22.0   7.2500
1    female  38.0  71.2833
2    female  26.0   7.9250
3    female  35.0  53.1000
4      male  35.0   8.0500
..      ...   ...      ...
886    male  27.0  13.0000
887  female  19.0  30.0000
888  female   NaN  23.4500
889    male  26.0  30.0000
890    male  32.0   7.7500

[891 rows x 3 columns]

In [7]:
# Quantidades de linhas
print(train_dataset.head(7))

   PassengerId  Survived  Pclass  \
0            1         0       3
1            2         1       1
2            3         1       3
3            4         1       1
4            5         0       3
5            6         0       3
6            7         0       1

                                                Name     Sex   Age  SibSp  \
0                            Braund, Mr. Owen Harris    male  22.0      1
1  Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                             Heikkinen, Miss. Laina  female  26.0      0
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                           Allen, Mr. William Henry    male  35.0      0
5                                   Moran, Mr. James    male   NaN      0
6                            McCarthy, Mr. Timothy J    male  54.0      0

   Parch            Ticket     Fare Cabin Embarked
0      0         A/5 21171   7.2500   NaN        S
1      0          PC 17599  71.2833   C85        C
2      0  STON/O2. 3101282   7.9250   NaN        S
3      0            113803  53.1000  C123        S
4      0            373450   8.0500   NaN        S
5      0            330877   8.4583   NaN        Q
6      0             17463  51.8625   E46        S

In [8]:
# Esta função retorna as últimas n linhas do objeto com base na posição. É útil para verificar dados rapidamente, por exemplo, após classificar ou anexar linhas.
print(train_dataset.tail())

     PassengerId  Survived  Pclass                                      Name  \
886          887         0       2                     Montvila, Rev. Juozas
887          888         1       1              Graham, Miss. Margaret Edith
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"
889          890         1       1                     Behr, Mr. Karl Howell
890          891         0       3                       Dooley, Mr. Patrick

        Sex   Age  SibSp  Parch      Ticket   Fare Cabin Embarked
886    male  27.0      0      0      211536  13.00   NaN        S
887  female  19.0      0      0      112053  30.00   B42        S
888  female   NaN      1      2  W./C. 6607  23.45   NaN        S
889    male  26.0      0      0      111369  30.00  C148        C
890    male  32.0      0      0      370376   7.75   NaN        Q

In [9]:
# Apenas os labels ou Colunas
print(train_dataset.columns)

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [10]:
# Quantas linhas e colunas
print(train_dataset.shape)

(891, 12)

In [11]:
# Descritivo de valores dentro do dataset
print(train_dataset.describe())

       PassengerId    Survived      Pclass         Age       SibSp  \
count   891.000000  891.000000  891.000000  714.000000  891.000000
mean    446.000000    0.383838    2.308642   29.699118    0.523008
std     257.353842    0.486592    0.836071   14.526497    1.102743
min       1.000000    0.000000    1.000000    0.420000    0.000000
25%     223.500000    0.000000    2.000000   20.125000    0.000000
50%     446.000000    0.000000    3.000000   28.000000    0.000000
75%     668.500000    1.000000    3.000000   38.000000    1.000000
max     891.000000    1.000000    3.000000   80.000000    8.000000

            Parch        Fare
count  891.000000  891.000000
mean     0.381594   32.204208
std      0.806057   49.693429
min      0.000000    0.000000
25%      0.000000    7.910400
50%      0.000000   14.454200
75%      0.000000   31.000000
max      6.000000  512.329200

In [12]:
# Fazendo uma condição dentro do dataframe
print(train_dataset[train_dataset.Sex == "female"])

     PassengerId  Survived  Pclass  \
1              2         1       1
2              3         1       3
3              4         1       1
8              9         1       3
9             10         1       2
..           ...       ...     ...
880          881         1       2
882          883         0       3
885          886         0       3
887          888         1       1
888          889         0       3

                                                  Name     Sex   Age  SibSp  \
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
8    Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)  female  27.0      0
9                  Nasser, Mrs. Nicholas (Adele Achem)  female  14.0      1
..                                                 ...     ...   ...    ...
880       Shelley, Mrs. William (Imanita Parrish Hall)  female  25.0      0
882                       Dahlberg, Miss. Gerda Ulrika  female  22.0      0
885               Rice, Mrs. William (Margaret Norton)  female  39.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1

     Parch            Ticket     Fare Cabin Embarked
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
8        2            347742  11.1333   NaN        S
9        0            237736  30.0708   NaN        C
..     ...               ...      ...   ...      ...
880      1            230433  26.0000   NaN        S
882      0              7552  10.5167   NaN        S
885      5            382652  29.1250   NaN        Q
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S

[314 rows x 12 columns]

### Manipulação

In [13]:
titanic = pd.read_csv('train.csv')
titanic = titanic.drop('Name',axis=1)
print(titanic.head())

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch  \
0            1         0       3    male  22.0      1      0
1            2         1       1  female  38.0      1      0
2            3         1       3  female  26.0      0      0
3            4         1       1  female  35.0      1      0
4            5         0       3    male  35.0      0      0

             Ticket     Fare Cabin Embarked
0         A/5 21171   7.2500   NaN        S
1          PC 17599  71.2833   C85        C
2  STON/O2. 3101282   7.9250   NaN        S
3            113803  53.1000  C123        S
4            373450   8.0500   NaN        S

In [16]:
# Drop de coluna pelo indice
titanic = titanic.drop(0)
print(titanic.head())

   PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch  \
1            2         1       1  female  38.0      1      0
2            3         1       3  female  26.0      0      0
3            4         1       1  female  35.0      1      0
4            5         0       3    male  35.0      0      0
5            6         0       3    male   NaN      0      0

             Ticket     Fare Cabin Embarked
1          PC 17599  71.2833   C85        C
2  STON/O2. 3101282   7.9250   NaN        S
3            113803  53.1000  C123        S
4            373450   8.0500   NaN        S
5            330877   8.4583   NaN        Q

Para alterar valores de uma coluna, utilizamos a mesma forma de quando estamos extraindo o valor de uma coluna, definindo então o valor. É possível definir um valor único para toda coluna, usar funções como range ou funções para geração de números aleatórios ou então passar uma lista ou array, mas neste caso, a lista ou array deve ter o mesmo comprimento do DataFrame.

In [17]:
train_dataset['Embarked'] = "Porto"
print(train_dataset['Embarked'])

0      Porto
1      Porto
2      Porto
3      Porto
4      Porto
       ...
886    Porto
887    Porto
888    Porto
889    Porto
890    Porto
Name: Embarked, Length: 891, dtype: object

In [18]:
train_df = pd.read_csv('train.csv')
train_df = train_df.drop('Name',axis=1)

Você também pode criar uma nova coluna, definindo valores para uma coluna com um nome que ainda não exista no DataFrame. No caso do nosso Dataset, por exemplo, a coluna “SibSp” é o número de irmãos e cônjuge, e a coluna “Parch” é o número de filhos ou pais no navio. Vamos criar a coluna “Tamanho_familia” somando estas duas colunas:

In [19]:
train_df['Tamanho_Familia'] = train_df['SibSp'] + train_df['Parch']
print(train_df['Tamanho_Familia'])

0      1
1      1
2      0
3      1
4      0
      ..
886    0
887    0
888    3
889    0
890    0
Name: Tamanho_Familia, Length: 891, dtype: int64

### NaN

In [20]:
train_df['Cabin'].isnull()

0       True
1      False
2       True
3      False
4       True
       ...
886     True
887    False
888     True
889    False
890     True
Name: Cabin, Length: 891, dtype: bool

Entretanto, se você quer saber quais colunas do seu Dataset possuem valores inexistentes e ele possui muitas linhas e colunas, a abordagem anterior não é muito prática. Para estes casos você pode usar o isnull() junto com o any(). Isto lhe dirá, coluna a coluna, se qualquer um dos valores é inexistente. Além disso, você também pode usar os comandos notnull() e all(), para dizer se as colunas estão completas.

In [21]:
train_df.isnull().any()

PassengerId        False
Survived           False
Pclass             False
Sex                False
Age                 True
SibSp              False
Parch              False
Ticket             False
Fare               False
Cabin               True
Embarked            True
Tamanho_Familia    False
dtype: bool

In [22]:
# Ou all
train_df.notnull().all()

PassengerId         True
Survived            True
Pclass              True
Sex                 True
Age                False
SibSp               True
Parch               True
Ticket              True
Fare                True
Cabin              False
Embarked           False
Tamanho_Familia     True
dtype: bool

Para começar, o comando dropna() remove do DataFrame qualquer linha que tenha pelo menos um NaN. Caso passemos o argumento how=’all’, ele só remove as linhas em que todas as colunas são NaN. Para remover colunas, usa-se o mesmo comando, mas passando também o argumento axis=1.

In [23]:
print(train_df.dropna().head())

    PassengerId  Survived  Pclass     Sex   Age  SibSp  Parch    Ticket  \
1             2         1       1  female  38.0      1      0  PC 17599
3             4         1       1  female  35.0      1      0    113803
6             7         0       1    male  54.0      0      0     17463
10           11         1       3  female   4.0      1      1   PP 9549
11           12         1       1  female  58.0      0      0    113783

       Fare Cabin Embarked  Tamanho_Familia
1   71.2833   C85        C                1
3   53.1000  C123        S                1
6   51.8625   E46        S                0
10  16.7000    G6        S                2
11  26.5500  C103        S                0

In [24]:
print(train_df.dropna(axis=1).head())

   PassengerId  Survived  Pclass     Sex  SibSp  Parch            Ticket  \
0            1         0       3    male      1      0         A/5 21171
1            2         1       1  female      1      0          PC 17599
2            3         1       3  female      0      0  STON/O2. 3101282
3            4         1       1  female      1      0            113803
4            5         0       3    male      0      0            373450

      Fare  Tamanho_Familia
0   7.2500                1
1  71.2833                1
2   7.9250                0
3  53.1000                1
4   8.0500                0

Caso você queira preencher os valores inexistentes, você deve usar a função fillna(). Nela, você passa o valor que deve substituir os NaN. Neste caso, provavelmente é melhor proceder coluna a coluna, devido a fatores como diferença no tipo de dados e também uma estratégia diferente na hora de preencher os valores inexistentes. Como vimos mais acima, as colunas “Age” e “Embarked” possuem valores inexistentes. Vamos preencher a coluna Age com a média das idades que temos no Dataset e a coluna Embarked com a moda, ou seja, o valor que mais ocorre nesta coluna. O fillna(), por padrão, retorna um novo objeto, mas você pode utilizar o argumento inplace=True para modificar o objeto original. Vamos então criar um novo DataFrame, filled_df, apenas para preservar o original, e vamos então preencher os inexistentes.

In [25]:
filled_df = train_df
filled_df['Age'].fillna(filled_df['Age'].mean(), inplace=True)
filled_df['Embarked'].fillna(filled_df['Embarked'].mode()[0], inplace=True)

# Agora podemos ver que as colunas Age e Embarked não possuem mais valores inexistentes
print(filled_df.isnull().any())

PassengerId        False
Survived           False
Pclass             False
Sex                False
Age                False
SibSp              False
Parch              False
Ticket             False
Fare               False
Cabin               True
Embarked           False
Tamanho_Familia    False
dtype: bool

Para trabalhar com linhas duplicadas, temos duas funções. A primeira, duplicated indica se cada linha é duplicada ou não. Por padrão, só retorna True se a linha inteira é exatamente igual a alguma anterior. Para verificar a repetição baseado em uma coluna, podemos passar o nome desta coluna como argumento, dentro de uma lista. Dentro desta lista também podemos passar mais de um nome de coluna, e neste caso será indicado True se o valor de todas estas colunas for igual. Já a função drop_duplicates já remove todas as colunas duplicadas. Funciona da mesma forma que a anterior, ou seja, por padrão só remove a linha se ela for inteira igual a alguma linha anterior, mas pode remover baseando-se em valores de colunas. Vamos ver alguns exemplos com a coluna de “Embarked”. Por ter somente três valores, sabemos que vamos ver muitos valores duplicados nela:

In [26]:
print(train_df.duplicated("Embarked"))

0      False
1      False
2       True
3       True
4       True
       ...
886     True
887     True
888     True
889     True
890     True
Length: 891, dtype: bool

In [27]:
drop_duplicate_df = train_df.drop_duplicates(['Embarked'])
print(drop_duplicate_df)

   PassengerId  Survived  Pclass     Sex        Age  SibSp  Parch     Ticket  \
0            1         0       3    male  22.000000      1      0  A/5 21171
1            2         1       1  female  38.000000      1      0   PC 17599
5            6         0       3    male  29.699118      0      0     330877

      Fare Cabin Embarked  Tamanho_Familia
0   7.2500   NaN        S                1
1  71.2833   C85        C                1
5   8.4583   NaN        Q                0

### Estatísticas em DataFrames

In [28]:
train_df.sum()

PassengerId                                                   397386
Survived                                                         342
Pclass                                                          2057
Sex                malefemalefemalefemalemalemalemalemalefemalefe...
Age                                                          26461.9
SibSp                                                            466
Parch                                                            340
Ticket             A/5 21171PC 17599STON/O2. 31012821138033734503...
Fare                                                         28693.9
Embarked           SCSSSQSSSCSSSSSSQSSCSSQSSSCSQSCCQSCSCSSCSSCCQS...
Tamanho_Familia                                                  806
dtype: object

In [29]:
train_df.mean()

PassengerId        446.000000
Survived             0.383838
Pclass               2.308642
Age                 29.699118
SibSp                0.523008
Parch                0.381594
Fare                32.204208
Tamanho_Familia      0.904602
dtype: float64

In [30]:
train_df.max(axis=1)

0       22.0000
1       71.2833
2       26.0000
3       53.1000
4       35.0000
         ...
886    887.0000
887    888.0000
888    889.0000
889    890.0000
890    891.0000
Length: 891, dtype: float64

### Ordenando DataFrames (sorting)

In [31]:
new_train_df = train_df.reindex(list(reversed(range(891))))
new_train_df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tamanho_Familia
890,891,0,3,male,32.000000,0,0,370376,7.75,NaN,Q,0
889,890,1,1,male,26.000000,0,0,111369,30.00,C148,C,0
888,889,0,3,female,29.699118,1,2,W./C. 6607,23.45,NaN,S,3
887,888,1,1,female,19.000000,0,0,112053,30.00,B42,S,0
886,887,0,2,male,27.000000,0,0,211536,13.00,NaN,S,0

In [32]:
# Aqui, reordenamos na ordem certa através do sort_index()
new_train_df = new_train_df.sort_index()
new_train_df.head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tamanho_Familia
0,1,0,3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,1
1,2,1,1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,1,3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0
3,4,1,1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,0,3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [33]:
# Aqui você pode usar sort_index para ordenar de forma descendente
new_train_df.sort_index(ascending=False).head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tamanho_Familia
890,891,0,3,male,32.000000,0,0,370376,7.75,NaN,Q,0
889,890,1,1,male,26.000000,0,0,111369,30.00,C148,C,0
888,889,0,3,female,29.699118,1,2,W./C. 6607,23.45,NaN,S,3
887,888,1,1,female,19.000000,0,0,112053,30.00,B42,S,0
886,887,0,2,male,27.000000,0,0,211536,13.00,NaN,S,0

Também é possível ordenar pelos valores de uma coluna, através da função sort_values(). Dentro dela, você especifica através do argumento by o nome da coluna através da qual o DataFrame será ordenado.

In [34]:
new_train_df.sort_values(by='Age').head()

,PassengerId,Survived,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Tamanho_Familia
803,804,1,3,male,0.42,0,1,2625,8.5167,NaN,C,1
755,756,1,2,male,0.67,1,1,250649,14.5000,NaN,S,2
644,645,1,3,female,0.75,2,1,2666,19.2583,NaN,C,3
469,470,1,3,female,0.75,2,1,2666,19.2583,NaN,C,3
831,832,1,2,male,0.83,1,1,29106,18.7500,NaN,S,2